<template>
  <div class="question-cards">
    <question-card
      v-for="question in QUESTIONS"
      :key="question.answer"
      :text="question.text"
      :answer="question.answer"
    />
  </div>
</template>

<script lang="ts" setup>
import QuestionCard from '@/widgets/landing/asked-questions/ui/question-card/QuestionCard.vue'

const QUESTIONS = [
  {
    text: 'Кто может рекомендовать друзей?',
    answer:
      'Ты можешь порекомендовать друга и получить вознаграждение, если тебе есть 18 лет, а также ты не работаешь в Дом.ру. Если ты уже работаешь в Дом.ру, то можешь порекомендовать друга на любую вакансию на внутреннем портале.',
  },
  {
    text: 'Как порекомендовать друга?',
    answer:
      'Все вакансии для рекомендаций собраны на этой странице, открой подходящую. Обсуди с другом, интересно ли ему это предложение. Важно, чтобы человек знал о вакансии и компании и хотел пообщаться. Выбери нужную вакансии, нажми на кнопку «Рекомендовать» и заполни все поля.',
  },
  {
    text: 'Как я получу бонус?',
    answer:
      'После окончания контрольного периода рекомендованного друга специалист Дом.ру свяжется с тобой (по телефону или почте), чтобы обсудить процесс выплаты и подписание документов.',
  },
  {
    text: 'Как я узнаю, что мою рекомендацию увидели и связались с моим другом?',
    answer:
      'Мы пришлём уведомление на электронную почту тебе и другу, что рекомендация взята в работу.',
  },
]
</script>

<style>
.question-cards {
  display: flex;
  flex-direction: column;
  gap: 14px;
}
</style>
